melopero/ArduinoCore-mbed/boards.txt
shake.name=Melopero Shake
shake.build.core=arduino
shake.build.crossprefix=arm-none-eabi-
shake.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
shake.build.variant=MELOPERO_SHAKE
shake.build.mcu=cortex-m0plus
shake.build.extra_flags=
shake.build.fpu=
shake.build.float-abi=
shake.build.architecture=cortex-m0plus
shake.build.board=MELOPERO_SHAKE
shake.build.ldscript=linker_script.ld
shake.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
shake.compiler.mbed.defines={build.variant.path}/defines.txt
shake.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
shake.compiler.mbed.cflags={build.variant.path}/cflags.txt
shake.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
shake.compiler.mbed.includes={build.variant.path}/includes.txt
shake.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
shake.compiler.mbed="{build.variant.path}/libs/libmbed.a"
shake.vid.0=0x2e8a 
shake.pid.0=0x00C0
shake.upload.tool=picotool
shake.upload.protocol=
shake.upload.use_1200bps_touch=true
shake.upload.wait_for_upload_port=false
shake.upload.native_usb=true
shake.upload.maximum_size=16777216
shake.upload.maximum_data_size=270336
shake.bootloader.tool=openocd
shake.bootloader.config=-f target/rp2040.cfg
shake.bootloader.programmer=-f interface/cmsis-dap.cfg
